MikroElektronika/core_packages/PIC/XC8/def/PIC16F1613/mcu.h
// Register: CWG1OCON0
#define CWG1OCON0 CWG1OCON0
extern volatile unsigned char           CWG1OCON0           __at(0x695);
#ifndef _LIB_BUILD
asm("CWG1OCON0 equ 0695h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned OVRA                   :1;
        unsigned OVRB                   :1;
        unsigned OVRC                   :1;
        unsigned OVRD                   :1;
    };
    struct {
        unsigned CWG1STRA               :1;
        unsigned CWG1STRB               :1;
        unsigned CWG1STRC               :1;
        unsigned CWG1STRD               :1;
        unsigned CWG1OVRA               :1;
        unsigned CWG1OVRB               :1;
        unsigned CWG1OVRC               :1;
        unsigned CWG1OVRD               :1;
    };
} CWG1OCON0bits_t;
extern volatile CWG1OCON0bits_t CWG1OCON0bits __at(0x695);
// bitfield macros
#define _CWG1OCON0_STRA_POSN                                0x0
#define _CWG1OCON0_STRA_POSITION                            0x0
#define _CWG1OCON0_STRA_SIZE                                0x1
#define _CWG1OCON0_STRA_LENGTH                              0x1
#define _CWG1OCON0_STRA_MASK                                0x1
#define _CWG1OCON0_STRB_POSN                                0x1
#define _CWG1OCON0_STRB_POSITION                            0x1
#define _CWG1OCON0_STRB_SIZE                                0x1
#define _CWG1OCON0_STRB_LENGTH                              0x1
#define _CWG1OCON0_STRB_MASK                                0x2
#define _CWG1OCON0_STRC_POSN                                0x2
#define _CWG1OCON0_STRC_POSITION                            0x2
#define _CWG1OCON0_STRC_SIZE                                0x1
#define _CWG1OCON0_STRC_LENGTH                              0x1
#define _CWG1OCON0_STRC_MASK                                0x4
#define _CWG1OCON0_STRD_POSN                                0x3
#define _CWG1OCON0_STRD_POSITION                            0x3
#define _CWG1OCON0_STRD_SIZE                                0x1
#define _CWG1OCON0_STRD_LENGTH                              0x1
#define _CWG1OCON0_STRD_MASK                                0x8
#define _CWG1OCON0_OVRA_POSN                                0x4
#define _CWG1OCON0_OVRA_POSITION                            0x4
#define _CWG1OCON0_OVRA_SIZE                                0x1
#define _CWG1OCON0_OVRA_LENGTH                              0x1
#define _CWG1OCON0_OVRA_MASK                                0x10
#define _CWG1OCON0_OVRB_POSN                                0x5
#define _CWG1OCON0_OVRB_POSITION                            0x5
#define _CWG1OCON0_OVRB_SIZE                                0x1
#define _CWG1OCON0_OVRB_LENGTH                              0x1
#define _CWG1OCON0_OVRB_MASK                                0x20
#define _CWG1OCON0_OVRC_POSN                                0x6
#define _CWG1OCON0_OVRC_POSITION                            0x6
#define _CWG1OCON0_OVRC_SIZE                                0x1
#define _CWG1OCON0_OVRC_LENGTH                              0x1
#define _CWG1OCON0_OVRC_MASK                                0x40
#define _CWG1OCON0_OVRD_POSN                                0x7
#define _CWG1OCON0_OVRD_POSITION                            0x7
#define _CWG1OCON0_OVRD_SIZE                                0x1
#define _CWG1OCON0_OVRD_LENGTH                              0x1
#define _CWG1OCON0_OVRD_MASK                                0x80
#define _CWG1OCON0_CWG1STRA_POSN                            0x0
#define _CWG1OCON0_CWG1STRA_POSITION                        0x0
#define _CWG1OCON0_CWG1STRA_SIZE                            0x1
#define _CWG1OCON0_CWG1STRA_LENGTH                          0x1
#define _CWG1OCON0_CWG1STRA_MASK                            0x1
#define _CWG1OCON0_CWG1STRB_POSN                            0x1
#define _CWG1OCON0_CWG1STRB_POSITION                        0x1
#define _CWG1OCON0_CWG1STRB_SIZE                            0x1
#define _CWG1OCON0_CWG1STRB_LENGTH                          0x1
#define _CWG1OCON0_CWG1STRB_MASK                            0x2
#define _CWG1OCON0_CWG1STRC_POSN                            0x2
#define _CWG1OCON0_CWG1STRC_POSITION                        0x2
#define _CWG1OCON0_CWG1STRC_SIZE                            0x1
#define _CWG1OCON0_CWG1STRC_LENGTH                          0x1
#define _CWG1OCON0_CWG1STRC_MASK                            0x4
#define _CWG1OCON0_CWG1STRD_POSN                            0x3
#define _CWG1OCON0_CWG1STRD_POSITION                        0x3
#define _CWG1OCON0_CWG1STRD_SIZE                            0x1
#define _CWG1OCON0_CWG1STRD_LENGTH                          0x1
#define _CWG1OCON0_CWG1STRD_MASK                            0x8
#define _CWG1OCON0_CWG1OVRA_POSN                            0x4
#define _CWG1OCON0_CWG1OVRA_POSITION                        0x4
#define _CWG1OCON0_CWG1OVRA_SIZE                            0x1
#define _CWG1OCON0_CWG1OVRA_LENGTH                          0x1
#define _CWG1OCON0_CWG1OVRA_MASK                            0x10
#define _CWG1OCON0_CWG1OVRB_POSN                            0x5
#define _CWG1OCON0_CWG1OVRB_POSITION                        0x5
#define _CWG1OCON0_CWG1OVRB_SIZE                            0x1
#define _CWG1OCON0_CWG1OVRB_LENGTH                          0x1
#define _CWG1OCON0_CWG1OVRB_MASK                            0x20
#define _CWG1OCON0_CWG1OVRC_POSN                            0x6
#define _CWG1OCON0_CWG1OVRC_POSITION                        0x6
#define _CWG1OCON0_CWG1OVRC_SIZE                            0x1
#define _CWG1OCON0_CWG1OVRC_LENGTH                          0x1
#define _CWG1OCON0_CWG1OVRC_MASK                            0x40
#define _CWG1OCON0_CWG1OVRD_POSN                            0x7
#define _CWG1OCON0_CWG1OVRD_POSITION                        0x7
#define _CWG1OCON0_CWG1OVRD_SIZE                            0x1
#define _CWG1OCON0_CWG1OVRD_LENGTH                          0x1
#define _CWG1OCON0_CWG1OVRD_MASK                            0x80

